/*
历史任务的单例
*/

pragma Singleton  //设置为单例必须要加的一句话
import QtQuick 2.0

Item {
    property var historyTaskInfo: {
        "obj":[
            {
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            },{
                "name":"新冠病毒培养任务",
                "startTime":"2020-01-10 10:02",
                "finishTime":"2020-01-11 10:09"
            }
        ]
    }
}
